In [1]:
from pathlib import Path

from IPython.display import Markdown, display
from sql_8week_danny.sql_engine import DuckDBEngine

In [2]:
duck = DuckDBEngine(db_path="dvd_rentals.db")

2024-04-21 08:28:41.342 | INFO     | sql_8week_danny.sql_engine:__init__:16 - Persisting dvd_rentals.db

In [3]:
# duck.query("CREATE SCHEMA dvd_rentals;")

In [4]:
table_names = [
    str(csv.stem)
    for csv in list((Path.cwd().parents[2] / "external/serious-sql-environment/data/dvd-rentals/").glob("*.csv"))
]

In [5]:
for table in table_names:
    duck.query(
        f"CREATE OR REPLACE TABLE {table} AS SELECT * FROM read_csv('/Users/mjboothaus/code/github/external/serious-sql-environment/data/dvd-rentals/{table}.csv')"
    )

In [6]:
table_names

['staff',
 'actor',
 'film',
 'film_category',
 'customer',
 'language',
 'film_actor',
 'address',
 'city',
 'country',
 'payment',
 'category',
 'rental',
 'store',
 'inventory']

In [7]:
def display_all_table_info(display_tables=False):
    for table in sorted(table_names):
        df = duck.query(f"SELECT * FROM {table}")
        display(Markdown(f"{table}: {len(df)} records"))
        if display_tables:
            display(df)

In [8]:
display_all_table_info(True)

actor: 200 records

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

address: 603 records

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,1,47 MySakila Drive,None,,300,NaN,,2006-02-15 04:45:30
1,2,28 MySQL Boulevard,None,,576,NaN,,2006-02-15 04:45:30
2,3,23 Workhaven Lane,None,,300,NaN,,2006-02-15 04:45:30
3,4,1411 Lillydale Drive,None,,576,NaN,,2006-02-15 04:45:30
4,5,1913 Hanoi Way,None,,463,35200.0,,2006-02-15 04:45:30
...,...,...,...,...,...,...,...,...
598,601,844 Bucuresti Place,None,,242,36603.0,,2006-02-15 04:45:30
599,602,1101 Bucuresti Boulevard,None,,401,97661.0,,2006-02-15 04:45:30
600,603,1103 Quilmes Boulevard,None,,503,52137.0,,2006-02-15 04:45:30
601,604,1331 Usak Boulevard,None,,296,61960.0,,2006-02-15 04:45:30
602,605,1325 Fukuyama Street,None,,537,27107.0,,2006-02-15 04:45:30

category: 16 records

    category_id         name         last_update
0             1       Action 2006-02-15 04:46:27
1             2    Animation 2006-02-15 04:46:27
2             3     Children 2006-02-15 04:46:27
3             4     Classics 2006-02-15 04:46:27
4             5       Comedy 2006-02-15 04:46:27
5             6  Documentary 2006-02-15 04:46:27
6             7        Drama 2006-02-15 04:46:27
7             8       Family 2006-02-15 04:46:27
8             9      Foreign 2006-02-15 04:46:27
9            10        Games 2006-02-15 04:46:27
10           11       Horror 2006-02-15 04:46:27
11           12        Music 2006-02-15 04:46:27
12           13          New 2006-02-15 04:46:27
13           14       Sci-Fi 2006-02-15 04:46:27
14           15       Sports 2006-02-15 04:46:27
15           16       Travel 2006-02-15 04:46:27

city: 600 records

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 04:45:25
1          2                Abha          82 2006-02-15 04:45:25
2          3           Abu Dhabi         101 2006-02-15 04:45:25
3          4                Acua          60 2006-02-15 04:45:25
4          5               Adana          97 2006-02-15 04:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 04:45:25
596      597        Zeleznogorsk          80 2006-02-15 04:45:25
597      598         Zhezqazghan          51 2006-02-15 04:45:25
598      599            Zhoushan          23 2006-02-15 04:45:25
599      600          Ziguinchor          83 2006-02-15 04:45:25

[600 rows x 4 columns]

country: 109 records

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             2               Algeria 2006-02-15 04:44:00
2             3        American Samoa 2006-02-15 04:44:00
3             4                Angola 2006-02-15 04:44:00
4             5              Anguilla 2006-02-15 04:44:00
..          ...                   ...                 ...
104         105               Vietnam 2006-02-15 04:44:00
105         106  Virgin Islands, U.S. 2006-02-15 04:44:00
106         107                 Yemen 2006-02-15 04:44:00
107         108            Yugoslavia 2006-02-15 04:44:00
108         109                Zambia 2006-02-15 04:44:00

[109 rows x 3 columns]

customer: 599 records

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,True,2006-02-14,2006-02-15 04:57:20,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,True,2006-02-14,2006-02-15 04:57:20,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,True,2006-02-14,2006-02-15 04:57:20,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,True,2006-02-14,2006-02-15 04:57:20,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,True,2006-02-14,2006-02-15 04:57:20,1
...,...,...,...,...,...,...,...,...,...,...
594,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,True,2006-02-14,2006-02-15 04:57:20,1
595,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,True,2006-02-14,2006-02-15 04:57:20,1
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,True,2006-02-14,2006-02-15 04:57:20,1
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,True,2006-02-14,2006-02-15 04:57:20,1
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,True,2006-02-14,2006-02-15 04:57:20,1

film: 1000 records

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,2006-02-15 05:03:42,"{""Deleted Scenes"",""Behind the Scenes""}",'academi':1 'battl':15 'canadian':20 'dinosaur...
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,2006-02-15 05:03:42,"{Trailers,""Deleted Scenes""}",'ace':1 'administr':9 'ancient':19 'astound':4...
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,2006-02-15 05:03:42,"{Trailers,""Deleted Scenes""}",'adapt':1 'astound':4 'baloon':19 'car':11 'fa...
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,2006-02-15 05:03:42,"{Commentaries,""Behind the Scenes""}",'affair':1 'chase':14 'documentari':5 'fanci':...
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,2006-02-15 05:03:42,"{""Deleted Scenes""}",'african':1 'chef':11 'dentist':14 'documentar...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,None,6,0.99,183,9.99,G,2006-02-15 05:03:42,"{Trailers,""Behind the Scenes""}",'administr':12 'boat':8 'boy':17 'databas':11 ...
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,None,4,0.99,179,14.99,NC-17,2006-02-15 05:03:42,"{Trailers,""Behind the Scenes""}",'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,2006-02-15 05:03:42,"{""Deleted Scenes""}",'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,None,5,2.99,101,28.99,R,2006-02-15 05:03:42,"{Trailers,""Deleted Scenes""}",'ancient':19 'boat':11 'china':20 'discov':14 ...
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,2006-02-15 05:03:42,"{Trailers,Commentaries,""Behind the Scenes""}","'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona..."

film_actor: 5462 records

      actor_id  film_id         last_update
0            1        1 2006-02-15 05:05:03
1            1       23 2006-02-15 05:05:03
2            1       25 2006-02-15 05:05:03
3            1      106 2006-02-15 05:05:03
4            1      140 2006-02-15 05:05:03
...        ...      ...                 ...
5457       200      879 2006-02-15 05:05:03
5458       200      912 2006-02-15 05:05:03
5459       200      945 2006-02-15 05:05:03
5460       200      958 2006-02-15 05:05:03
5461       200      993 2006-02-15 05:05:03

[5462 rows x 3 columns]

film_category: 1000 records

     film_id  category_id         last_update
0          1            6 2006-02-15 05:07:09
1          2           11 2006-02-15 05:07:09
2          3            6 2006-02-15 05:07:09
3          4           11 2006-02-15 05:07:09
4          5            8 2006-02-15 05:07:09
..       ...          ...                 ...
995      996            6 2006-02-15 05:07:09
996      997           12 2006-02-15 05:07:09
997      998           11 2006-02-15 05:07:09
998      999            3 2006-02-15 05:07:09
999     1000            5 2006-02-15 05:07:09

[1000 rows x 3 columns]

inventory: 4581 records

      inventory_id  film_id  store_id         last_update
0                1        1         1 2006-02-15 05:09:17
1                2        1         1 2006-02-15 05:09:17
2                3        1         1 2006-02-15 05:09:17
3                4        1         1 2006-02-15 05:09:17
4                5        1         2 2006-02-15 05:09:17
...            ...      ...       ...                 ...
4576          4577     1000         1 2006-02-15 05:09:17
4577          4578     1000         2 2006-02-15 05:09:17
4578          4579     1000         2 2006-02-15 05:09:17
4579          4580     1000         2 2006-02-15 05:09:17
4580          4581     1000         2 2006-02-15 05:09:17

[4581 rows x 4 columns]

language: 6 records

   language_id                  name         last_update
0            1  English              2006-02-15 05:02:19
1            2  Italian              2006-02-15 05:02:19
2            3  Japanese             2006-02-15 05:02:19
3            4  Mandarin             2006-02-15 05:02:19
4            5  French               2006-02-15 05:02:19
5            6  German               2006-02-15 05:02:19

payment: 16049 records

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,1,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,573,0.99,2005-05-28 10:35:23
2,3,1,1,1185,5.99,2005-06-15 00:54:12
3,4,1,2,1422,0.99,2005-06-15 18:02:53
4,5,1,2,1476,9.99,2005-06-15 21:08:46
...,...,...,...,...,...,...
16044,16045,599,1,14599,4.99,2005-08-21 17:43:42
16045,16046,599,1,14719,1.99,2005-08-21 21:41:57
16046,16047,599,2,15590,8.99,2005-08-23 06:09:44
16047,16048,599,2,15719,2.99,2005-08-23 11:08:46
16048,16049,599,2,15725,2.99,2005-08-23 11:25:00

rental: 16044 records

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

staff: 2 records

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update,picture
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 04:57:16,None
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 04:57:16,None

store: 2 records

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 04:57:12
1         2                 2           2 2006-02-15 04:57:12

In [9]:
duck.query("SHOW TABLES;")

             name
0           actor
1         address
2        category
3            city
4         country
5        customer
6            film
7      film_actor
8   film_category
9       inventory
10       language
11        payment
12         rental
13          staff
14          store

In [10]:
duck.query(
    """
SELECT
  language_id,
  name
FROM dvd_rentals.language;
"""
)

   language_id                  name
0            1  English
1            2  Italian
2            3  Japanese
3            4  Mandarin
4            5  French
5            6  German

In [11]:
duck.query(
    """
SELECT *
FROM dvd_rentals.actor
LIMIT 10;
"""
)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5         6      BETTE     NICHOLSON 2006-02-15 04:34:33
6         7      GRACE        MOSTEL 2006-02-15 04:34:33
7         8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8         9        JOE         SWANK 2006-02-15 04:34:33
9        10  CHRISTIAN         GABLE 2006-02-15 04:34:33